index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-08 Sun 21:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>For when I'm gone.</title>
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
<link rel="stylesheet" href="reset.css">
<link rel="stylesheet" href="index.css">
<meta name="author" content="Wade Mealing" />
<meta name="description" content="Wade Mealings documentation" />
<meta http-equiv="Content-Security-Policy"  content="default-src 'self' 'unsafe-inline'; img-src https://*; child-src 'none';" />
<meta http-equiv="Content-Security-Policy" content="style-src-elem; img-src https://*; child-src 'none';" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">For when I'm gone.</h1>


<div id="outline-container-org3fd3d6a" class="outline-2">
<h2 id="org3fd3d6a"><a href="https://wmealing.github.io/custom-software-errors.html">The best error messages ive ever seen</a></h2>
<div class="outline-text-2" id="text-org3fd3d6a">
<p>
Writing clear and effective error messages is a crucial skill for any programmer, no matter what the language.  Well-crafted error messages will
improve the usability of software by guiding users to understand and resolve issues quickly. A good error message not only informs the user about
what went wrong but also suggests potential solutions or next steps. In this introductory paragraph, we will explore key principles and techniques
that can help developers create error messages that are informative, actionable, and user-friendly and more importantly take advantage of any
assistance and resources that you may have at your disposal.  I expanded on this a bit more <a href="https://wmealing.github.io/custom-software-errors.html">here</a>.
</p>
</div>
</div>

<div id="outline-container-org90f317c" class="outline-2">
<h2 id="org90f317c"><a href="http://wmealing.github.io/mac-os-midi-router-broken.html">Apple Mac OS Midi routing is broken.</a></h2>
<div class="outline-text-2" id="text-org90f317c">
<p>
I have some new music making hardware, and wanted to try to get them to talk together.  Use a Mac they
say 'everything just works',   No clearly it doesnt.  I did however find a work around.  If anyone
is trying to use a USB host to route a midi controller (USB organ) to a synth (USB) start <a href="http://wmealing.github.io/mac-os-midi-router-broken.html">Reading</a>
</p>
</div>
</div>

<div id="outline-container-org202b012" class="outline-2">
<h2 id="org202b012"><a href="http://wmealing.github.io/minimise.html">Minimise</a></h2>
<div class="outline-text-2" id="text-org202b012">
<p>
In the interest of not polluting the internet with my ill-informed opinion and staying
away from the madness that is modern culture, I've deleted a bunch of social media and
messenger accounts.  Less of me on the internet can only be a net win for society.
</p>
</div>
</div>


<div id="outline-container-org9b614c9" class="outline-2">
<h2 id="org9b614c9"><a href="./reverse-engineering-teenage-engineering.html">Downloading the EP133 firmware from Teenage Engineering</a></h2>
<div class="outline-text-2" id="text-org9b614c9">
<p>
Teenage Engineering released the EP-133, a mid range sampler/synth, I looked into the updater
to find out as much as I can before I buy one.  The firmware provided from teenage engineering
is encrypted, but i've <a href="./reverse-engineering-teenage-engineering.html">documented what i have found so far.</a>
</p>
</div>
</div>

<div id="outline-container-orgf9ce928" class="outline-2">
<h2 id="orgf9ce928"><a href="https://wmealing.github.io/atomic-operations-in-common-lisp.html">Atom(ic) Operations in Common Lisp</a> [2023]</h2>
<div class="outline-text-2" id="text-orgf9ce928">
<p>
So, the headline is a bit of a lie.  This entry talks about using clojure like "atoms" to simplify
management of shared, synchronous, independent state.  Common lisp being the all-singing all-dancing
monkey of the lisp world, i had to see if atoms can be used this way.  It turns out it is easier
than I thought. <a href="https://wmealing.github.io/atomic-operations-in-common-lisp.html">Check it.</a>
</p>
</div>
</div>


<div id="outline-container-orgec06746" class="outline-2">
<h2 id="orgec06746"><a href="https://wmealing.github.io/lfe-github-actions.html">Setting up GitHub Actions for LFE CI/CD</a> [2023]</h2>
<div class="outline-text-2" id="text-orgec06746">
<p>
I'm involved in 'competing' with <a href="https://spawnfest.org/">spawnfest</a> this weekend, I figured its time to setup <a href="lfe-github-actions.html">LFE for CI/CD with GitHub Actions</a>.
Its a pretty simple setup that runs the test, i'll expand on this in the future to include creating containers and
pushing to production.
</p>
</div>
</div>

<div id="outline-container-org0c5c235" class="outline-2">
<h2 id="org0c5c235"><a href="https://wmealing.github.io/htmx-common-lisp.html">Common Lisp and HTMX</a> [2023]</h2>
<div class="outline-text-2" id="text-org0c5c235">
<p>
Common lisp and HTMX provide a sane platform to develop basic applications.  I <a href="https://wmealing.github.io/htmx-common-lisp.html">outline the reasons</a> that I have chosen them.
This post also marks the new voice I plan to use while blogging. I no longer care to engage in debate with people without being paid.
</p>
</div>
</div>

<div id="outline-container-orgbe76b8f" class="outline-2">
<h2 id="orgbe76b8f"><a href="./emacs-org-babel-analysis.html ">Supercharge your workflow with emacs and org-babel</a>.</h2>
<div class="outline-text-2" id="text-orgbe76b8f">
<p>
I do kernel flaw analysis for a living, someone asked me to do a short write up on how I use org-babel to
do my work. I've documented it <a href="./emacs-org-babel-analysis.html">in this rant</a>.
</p>
</div>
</div>

<div id="outline-container-org904dac3" class="outline-2">
<h2 id="org904dac3">Lisp flavored erlang (gen_server)</h2>
<div class="outline-text-2" id="text-org904dac3">
<p>
I decided to collapse two of my interests, lisp and erlang.  Lisp flavored erlang isnt going to win
any popularity contests, but it is something that I dont entirely hate  working on.  Ive written
a quick tutorial describing one of the <a href="https://wmealing.github.io/lfe-gen-server.html">core features of erlang</a>.
</p>
</div>
</div>

<div id="outline-container-org943a87b" class="outline-2">
<h2 id="org943a87b">Choosing the wrong roads.</h2>
<div class="outline-text-2" id="text-org943a87b">
<p>
I've spent the last week reflecting on some poor programming life choices that I've made.
disagree with the majority, perhaps you are wrong.  I'm not stupid enough to think that i'm smarter
than most people.  To be honest its probably not worth reading because you already think just like
this.  If I <a href="https://wmealing.github.io/less-than-optimistic.html">write about it</a>, perhaps it will clear my mind.
</p>
</div>
</div>

<div id="outline-container-org76b4333" class="outline-2">
<h2 id="org76b4333">COBOL - Simple "Curses" like screen to get keyboard input.</h2>
<div class="outline-text-2" id="text-org76b4333">
<p>
On of the simple but effectively powerful things that gnuCOBOL can do is a TUI.  Its not
fancy (when it implements UTF8 correctly, it will be fancy-af) but it gets the job
done much quicker than most webapps do.
</p>

<p>
Check out my <a href="./simple-cobol-query.html">Simple example</a> which I've got working on Linux and MacOS X.
</p>
</div>
</div>

<div id="outline-container-org8ab3ae3" class="outline-2">
<h2 id="org8ab3ae3">Python Range function in lisp [Aug 2022]</h2>
<div class="outline-text-2" id="text-org8ab3ae3">
<p>
I have wanted a quick way to something similar to the python range function (range n y) in common lisp.
Sometimes I just want to have some kind of immediate list creation.  <a href="http://wmealing.github.io/lisp-range">See my drivel on this topic.</a>
</p>
</div>
</div>

<div id="outline-container-org1efb65d" class="outline-2">
<h2 id="org1efb65d">Simple WX example in erlang [July 2022]</h2>
<div class="outline-text-2" id="text-org1efb65d">
<p>
I don't always write a gui for my apps, but when I do, I use wx because I'm not one for complaining about pixel perfect pedantry.
</p>

<p>
The one that works for me at the moment is <a href="http://wmealing.github.io/wx-erlang-example">WX Erlang</a>
</p>
</div>
</div>

<div id="outline-container-org995c46e" class="outline-2">
<h2 id="org995c46e">MIRAI analysis - evasion - deleting the executing code [Nov 2020]</h2>
<div class="outline-text-2" id="text-org995c46e">
<p>
The MIRAI malware deletes itself from disk in an attempt to make it
harder to analyse. <a href="https://wmealing.github.io/mirai-delete-yourself">This post</a> goes into detail on how it works, a rust
implementation and a few improvements that could have been done.
</p>
</div>
</div>

<div id="outline-container-orge9b1654" class="outline-2">
<h2 id="orge9b1654">MIRAI analysis - watchdog access in rust [Nov 2020]</h2>
<div class="outline-text-2" id="text-orge9b1654">
<p>
The MIRAI malware uses an technique intended to prevent the systems
watchdog from rebooting the machine when its too busy.  <a href="https://wmealing.github.io/watchdog-in-rust">I share what I learned about this and ported it to rust.</a>
</p>
</div>
</div>

<div id="outline-container-org2d7bef3" class="outline-2">
<h2 id="org2d7bef3">Userspace eBPF [Sep 2 2020]</h2>
<div class="outline-text-2" id="text-org2d7bef3">
<p>
A few distros have users allowed to insert eBPF programs.  This is disabled in
some distributions.  <a href="./ebpf-disabled-for-users.html">I've documented my findings</a> after talking to different
decision holders who made some of these choices.
</p>
</div>
</div>

<div id="outline-container-org4df80db" class="outline-2">
<h2 id="org4df80db">Anatomy of kernel module signing  [Aug 20 2020]</h2>
<div class="outline-text-2" id="text-org4df80db">
<p>
I decided to take a look at the Linux kernel modules signing process.  It seems
that the recent drovorub malware has some interesting misinformation regarding 
module signing, so I had decided to take a look at the <a href="./signed-kernel-modules.html">regarding its implementations on Red hat Enterprise Linux</a>.
</p>
</div>
</div>

<div id="outline-container-orgfa4bd7d" class="outline-2">
<h2 id="orgfa4bd7d">Encrypting a disk to only boot in a specific system. [Aug 9 2020]</h2>
<div class="outline-text-2" id="text-orgfa4bd7d">
<p>
Recent research papers related to flaws in thunderbolt and secureboot have
piqued my interest in learning more about what can be done to prevent a system
comprimised in such a way from being abused.  I've written about
<a href="./tpm-pcr07.html">it here</a>
</p>
</div>
</div>

<div id="outline-container-org999978f" class="outline-2">
<h2 id="org999978f">Toshiba Toughpad FZ-G1-3 [Jul 25 2020]</h2>
<div class="outline-text-2" id="text-org999978f">
<p>
I have recently purchased one of these machines in an auction, and I am -very-
impressed with its build quality.   While this one is not its current purchase
release, I've got a page talking about the customizations and things I have
learned about it <a href="./toshiba-toughpad-fz-g1-3">While making it work for me</a>
</p>
</div>
</div>



<div id="outline-container-org62f43ed" class="outline-2">
<h2 id="org62f43ed">Kernel SecuriTea</h2>
<div class="outline-text-2" id="text-org62f43ed">
<p>
I work on a small youtube channel where I talk about kernel security issues
that interest me.  I work on quite a lot of these in my work so i'm limited to
what I can cover.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-09-08 Sun 21:46</p>
</div>
</body>
</html>
